
import Card  from "/11am-grp5-repo/src/Components/nutrition/Card";
import ReactDOM from "react-dom";



function Food() {
  return (
    <>
    <div className='contanar'>
      <div className='Fiber-Cards'>
    <Card image='/foodimages/protine.jpg' title="البروتينات" intro="البروتينات تلعب دورًا محوريًا في الرياضة والأنشطة البدنية نظرًا لدورها في بناء العضلات،
    إصلاح الأنسجة التالفة، وتعزيز الأداء الرياضي  .."
     info="  
     الرياضيون يحتاجون إلى كميات كافية من البروتين لدعم جهودهم التدريبية وتحقيق أهدافهم.
     تنقسم الأحماض الأمينيّة إلى نوعين، وهي: الأحماض الأمينية غير الأساسيّة التي يُصنّعها الجسم بنفسه، 
     والأحماض الأمينية الأساسيّة التي لا يُمكن للجسم أن يُصنعها، إذ يجب الحصول عليها من المصادر الغذائية، ويحتاج الجسم لجميع الأحماض الأمينية للمحافظة على صحته، ومن الجدير بالذكر أنّ الأطعمة التي تحتوي على البروتين الحيوانيّ 
     غالباً ما تكون غنيّةً بالعديد من العناصر الغذائية الأخرى، 
     مثل: فيتامين ب12، وفيتامين د، وحمض الدوكوساهكساينويك (بالإنجليزية: DHA)، والحديد الهيمي (بالإنجليزية: Heme-iron)، والزنك.[١] وهناك ثلاثةُ أنواع من البروتين في الطعام، الأول هو البروتين الكامل، والذي يضمّ الأطعمة التي تحتوي على جميع الأحماض الأمينية الأساسيّة، وهي متوفّرةٌ في المصادر الحيوانيّة مثل اللحوم، والبيض، وحليب الأبقار، والنوع الثاني هو البروتين غير الكامل، وتشمل الأطعمة تحتوي على نوعٍ واحدٍ على الأقلّ من الأحماض الأمينية الأساسيّة، ومنها: البازيلاء، والفاصولياء، والحبوب الكاملة، وأخيراً البروتينات المُكمّلة، 
     والتي تتكون من نوعين أو أكثر من الأطعمة التي تحتوي على البروتينات غير الكاملة، والتي يجب تناولها معاً للحصول على البروتين الكامل، ومنها: الخبز مع زبدة الفول السوداني، أو الأرُز مع الفاصولياء.
     "
      />
  
     <Card
      image='/foodimages/protine2.jpg'
       title="دورها في الرياضة" 
       intro=" المصادر الحيوانية
        ومن الأمثلة على المصادر الحيوانية للبروتين ما يأتي
        الدواجن: كالدجاج، والبط، والتيركي، فعلى سبيل المثال؛
        يحتوي 100 غرام من صدر .."

        info=" الدجاج المطبوخ منزوع الجلد (ما يعادل حجم راحة اليد) على 32.1 غراماً من البروتين.
        الأطعمة البحرية: كالسمك، والمحار، فعلى سبيل المثال؛ يحتوي 100 غرام من سمك التونا على 29.9 غراماً من البروتين.
        البيض: تحتوي البيضة الكبيرة المسلوقة بوزن 100 غرام على ما يقارب 12.6 غرامات من البروتين.
        الجبن: تحتوي قطعة جبن الشيدر بوزن 30 غراماً على 7 غرامات من البروتين.
        الألبان: تتمثل بالحليب واللبن، والتي يفضل الاعتدال في تناولها، فعلى سبيل المثال؛ 
        يحتوي كوب من الحليب قليل الدسم على 16.5 غرامات من البروتين.
        اللحوم الحمراء: والتي لا بد من تناولها باعتدال، فعلى سبيل المثال؛ 
        يحتوي 100 غرام من اللحم البقري (ما يعادل حجم راحة اليد) على 28.7 غراماً من البروتين.
        اللحوم المصنعة: كالنقانق، والمارتديلا، والسلامي، وغيرها من اللحوم الباردة،
        والتي لا بد من تجنبها أو الحد قدر الإمكان منها، وعلى سبيل المثال؛ يحتوي 100 غرام من السلامي على 12.2 غراماً من البروتين.
        "/>
     <Card
      image='/foodimages/protine3.jpg'
       title="مصادر البروتين " 
       intro="
        من المهم الحصول على البروتينات من المصادر النباتية أيضاً، وفي ما يأتي بعض الأمثلة على المجموعات النباتية التي تحتوي على البروتينات:
        " 
        info="
        البقوليات: كالعدس، والفاصولياء المجففة بأنواعها، والبازلاء، والحمص، والفول، وغيرها، وعلى سبيل المثال:
        يحتوي كوب العدس على 17.9 غراماً من البروتين.

        يحتوي كوب من الفاصولياء البيضاء على 17.4 غراماً من البروتين.
        المكسرات والبذور: على سبيل المثال:
        يحتوي 30 غراماً من اللوز على 6 غرامات من البروتين.
        تحتوي 30 غراماً من بذور الشيا على 5 غرامات من البروتين.
        الحبوب الكاملة: كالقمح الكامل، والشوفان الكامل، والكينوا، والشعير، والأرز، وغيرها، وعلى سبيل المثال
        يحتوي كوب من حبوب الكينوا المطبوخة على 8 غرامات من البروتين
        يحتوي كوب من الشوفان المطبوخ على 4 غرامات من البروتين."/>
      </div>
      <div className='carbohydrate-Cards'>
        <Card
          image='/foodimages/Carbs1.jpg'
          title="الكربوهيدرات " 
          intro="هي المصدر المفضل للجسم للحصول على الطاقة، يتم تفكيك الكربوهيدرات وهضمها لكي تتحول
           إلى جلوكوز لمد الجسم بطاقة للقيام بالعمليات الحيوية والخلوية."
          info="من الضروري أن يحتوي نظامك الغذائي على الكربوهيدرات 
          ولكن من الضروري أيضا التركيز في الأوقات التي تحصل فيها على الكربوهيدرات كونها مصدر طاقة أو محرك للجسم لممارسة الأنشطة البدنية.

          نسبة الكربوهيدرات المناسبة أثناء التمرين
          لا يوجد نسبة موحدة يختلف الأمر بناء على شدة تمرينك وهدفك، ولكن بشكل عام ينصح باستهلاك 
          ما بين 30-60 جرام كربوهيدرات في الساعة الواحدة خلال التمرين، ويمكنك التركيز بشكل أكبر مع مستويات الطاقة ومعدلات النشاط لديك،
          في حالة شعرت بالتعب الشديد يمكنك الاستعانة
          بالكربوهيدرات لزيادة مستوى الطاقة ورفع الأداء
                    
          " 
        />
        <Card
          image='/foodimages/Carbs2.jpg'
          title="أهمية الكربوهيدرات" 
          intro="مصدر طاقة رئيسي:
                يتم تحويل الكربوهيدرات في الجسم إلى جلوكوز، الذي يُستخدم كوقود للعضلات أثناء النشاط البدني.
                يتم تخزين الجلوكوز في العضلات والكبد على شكل جليكوجين، والذي يُستخدم خلال التمارين المكثفة والطويلة."
          info="
              الكربوهيدرات ودورها في الرياضة
              الكربوهيدرات تعد أحد العناصر الغذائية الأساسية التي يحتاجها الجسم، خاصة للرياضيين، لأنها المصدر الرئيسي للطاقة. تلعب دورًا حيويًا في تحسين الأداء الرياضي، زيادة القدرة على التحمل، وتسريع التعافي بعد التمارين.
              أهمية الكربوهيدرات في الرياضة:
              مصدر طاقة رئيسي:
              يتم تحويل الكربوهيدرات في الجسم إلى جلوكوز، الذي يُستخدم كوقود للعضلات أثناء النشاط البدني.
              يتم تخزين الجلوكوز في العضلات والكبد على شكل جليكوجين، والذي يُستخدم خلال التمارين المكثفة والطويلة.
              تعزيز الأداء الرياضي:
              تساعد الكربوهيدرات على تأخير التعب وزيادة القدرة على التحمل أثناء التمارين الطويلة.
              تناول الكربوهيدرات قبل التمارين يعزز من مستويات الطاقة في الجسم.
              التعافي بعد التمارين:
              بعد التمارين، يساعد تناول الكربوهيدرات في استعادة مخزون الجليكوجين المفقود في العضلات والكبد.
              تسريع عملية التعافي يسمح للرياضي بالعودة إلى التمارين بسرعة أكبر." 
        />
        <Card
          image='/foodimages/Carbs3.jpg'
          title="متى نتناول الكربوهيدرات؟" 
          intro="قبل التمارين:
          تناول وجبة غنية بالكربوهيدرات قبل 2-3 ساعات من التمرين لتعزيز مستويات الطاقة.
          أمثلة: الشوفان مع الفواكه أو الأرز مع الدجاج."
          info="أثناء التمارين الطويلة:
            في التمارين التي تدوم أكثر من ساعة، يُوصى بتناول مصادر سريعة للكربوهيدرات (مثل مشروبات الطاقة أو الفواكه المجففة) كل 20-30 دقيقة.
            بعد التمارين:
            تناول الكربوهيدرات مباشرة بعد التمارين (خلال 30 دقيقة) لاستعادة مخزون الجليكوجين.
            يمكن دمجها مع بروتين لتعزيز عملية التعافي" 
        />
      </div>
      <div className='Fiber-Cards'>
        <Card
          image='/foodimages/fiber1.jpg'
          title="الألياف الغذائي"
          intro="تعد جزءًا مهمًا من النظام الغذائي الصحي، ولها دور هام في تحسين صحة الجهاز الهضمي والحفاظ على توازن الجسم.
           وعلى الرغم من أن الألياف ليست مصدرًا مباشرًا للطاقة، إلا أنها تلعب دورًا حيويًا للرياضيين من خلال تحسين أداء 
           الجهاز الهضمي وتحقيق التوازن الغذائي."
         
          info="مكونات موجودة في الأطعمة النباتية التي لا يستطيع الجهاز الهضمي هضمها بالكامل أو امتصاصها. على الرغم من أنها لا تُهضم مثل العناصر الغذائية الأخرى (مثل البروتينات والدهون والكربوهيدرات)، فإنها تلعب دورًا حيويًا في صحة الجهاز الهضمي وأداء الجسم بشكل عام." 
        />
        <Card
          image='/foodimages/fiber2.jpg'
           title="فوائد الألياف" 
          intro="تحسين صحة الجهاز الهضمي:

تساعد الألياف على تعزيز حركة الأمعاء وتنظيم عملية الهضم،
 مما يقلل من مشاكل الجهاز الهضمي التي قد تؤثر على أداء الرياضي."
          info="الحفاظ على طاقة مستدامة:

تناول الألياف مع الكربوهيدرات يساعد على إطلاق الطاقة بشكل بطيء وثابت، مما يمد الجسم بالطاقة لفترة أطول.
السيطرة على الوزن:

الألياف تمنح شعورًا بالشبع لفترة أطول، مما يساعد الرياضيين في الحفاظ على وزن صحي.
تقليل مخاطر الأمراض:

الألياف تساهم في تقليل مخاطر الإصابة بأمراض القلب والسكري، مما يحسن صحة الرياضيين العامة.
" 
        />
        <Card
          image='/foodimages/fiber3.jpg'
          title="مصادر غذائية غنية بالألياف " 
          intro="الخضروات:

            السبانخ
            البروكلي
            الجزر"
          info="الفواكه:
            التوت
            التفاح (بالقشر)
            الكمثرى
            الحبوب الكاملة:

            الشوفان
            الأرز البني
            الكينوا
            البقوليات:

            العدس
            الفاصولياء السوداء
            الحمص
            المكسرات والبذور:

            اللوز
            بذور الشيا
            بذور الكتان
            " 
        />
    </div>
  
    </div>
    
    </>
  );
}
export default Food;
