import React from "react";

 const Content = () => {
    return (

        <div className="f1">
             <h1>

<b>
    الاكاديميات والاندية المحلية في فلسطين
</b>
    </h1>

<p>
    النوادي الرياضية الفلسطينية تعتبر جزءًا هامًا من النسيج الثقافي والاجتماعي في فلسطين. تشكلت هذه
     النوادي منذ بدايات القرن العشرين، وكانت تحمل في طياتها رسالة تتجاوز
     الرياضة لتشمل تعزيز الهوية الوطنية والحفاظ على التراث الثقافي الفلسطيني.

    تنتشر النوادي الرياضية في مختلف المدن والقرى الفلسطينية،
     وهي تقدم مجموعة متنوعة من الرياضات مثل كرة القدم، كرة السلة، كرة الطائرة، وألعاب القوى. وتعد كرة 
    القدم الأكثر شعبية، حيث يتم تنظيم بطولات محلية وإقليمية تحت إشراف الاتحاد 
    الفلسطيني لكرة القدم، وهو عضو في الاتحاد الدولي لكرة القدم (FIFA).
 </p>


<hr/>
 <div className="palestine"> 

<ul>

<li >

        <div id="c1">
     <h2 className="city">            مدينة الخليل :
     </h2>
 
      <p>
     <b>   
       كرة القدم:
     </b>    
         <br/>

     نادي شباب الخليل: أقدم وأكبر أندية الخليل، يتميز بجماهيره العريضة وإنجازاته المحلية.
         نادي الظاهرية: نادي عريق له تاريخ حافل في كرة القدم الفلسطينية.
         <br/>
         <br/>
     <b>
         كرة السلة:
     </b>
         <br/>
         أكاديمية الخليل لكرة السلة: تقدم تدريبات للأطفال والشباب وتشارك في بطولات محلية.

         <br/><br/>
 
     <b>    السباحة:
     </b>
         <br/>
         مسبح جامعة الخليل: يقدم تدريبات سباحة لجميع الأعمار.
 
     </p>

      </div>
         <hr/>
      </li>

     <li>
     <div id="c2">
     <h3 className="city">
        نابلس:
     </h3>
    
     <p>
     
   
   
       <b>كرة القدم:</b>    
           <br/>
           مركز بلاطة: من أقوى الأندية في شمال الضفة الغربية ويشتهر بلقب “الجدعان”.
           نادي عيبال: يُركز على تدريب الناشئين.
           <br/><br/>
   
       <b>كرة السلة:</b>
       <br/>
           نادي عيبال الرياضي: أحد أقدم أندية كرة السلة في فلسطين.
           نادي الاتحاد: يقدم برامج تدريبية للشباب.
        <br/>
        <br/>
   
       <b>تنس الطاولة:</b>
       <br/>
   
           أكاديمية نابلس لتنس الطاولة: تُدرّب الشباب على هذه الرياضة وتشارك في بطولات محلية.
          </p>

     </div>
      <hr/>
    </li>

    <li>
    <div id="c3">
    <h4 className="city">        قلقيلية:
    </h4>
    
        <p>
            <b>كرة القدم:</b>
              <br/>
                إسلامي قلقيلية: نادي رياضي يمثل المدينة في دوري المحترفين.
             <br/>
              <br/>
            <b>كرة الطائرة:
            </b>
                 <br/>
            نادي قلقيلية الرياضي: يُركز على تطوير رياضة كرة الطائرة.
        
        </p>
</div>      
</li>
<hr/>

<li>
       <div id="c4">



    <h5 className="city">        القدس:
 </h5>
    <p>
        <b>    كرة القدم:   </b>
    <br/>
        هلال القدس: أحد أقوى الأندية الفلسطينية ويمثل العاصمة في البطولات الدولية.
        جبل المكبر: يتميز بأدائه في الدوري الفلسطيني.
    <br/>
    <br/>

    <b>    كرة السلة:
    </b>
    <br/>
    أكاديمية القدس لكرة السلة: تهتم بتطوير مهارات الشباب في رياضة كرة السلة.
    <br/>
    <br/>

    <b>    السباحة:
    </b>

    <br/>
    
    نادي السباحة الفلسطيني: يقدم دورات تدريبية للأطفال والكبار.
 </p>

</div>
</li>
<hr/>
<li>
<div id="c5">
 <p className="city">  
  <b>  طولكرم:</b>
 </p>

 <p>
 <b> كرة القدم:</b>
    <br/>
    ثقافي طولكرم: نادي رياضي عريق يمثل طولكرم في دوري المحترفين.
    <br/><br/>
<b>  كرة الطائرة:</b>  
    <br/>
    نادي طولكرم الرياضي: يُشارك في بطولات كرة الطائرة المحلية.

</p>
</div>
<hr/>
</li>



<li>
<div id="c6">
<p className="city">  
 <b>  رام الله :</b>
 
</p>

<p>
 <b> كرة القدم:</b>
   <br/>
   مركز الأمعري: يمثل مخيم الأمعري في البطولات المحلية.
   مؤسسة البيرة: أحد الأندية الرياضية والثقافية في المدينة.

   <br/><br/>
  <b>  كرة السلة:</b>  
   <br/>
   نادي أرثوذكسي رام الله: يُعتبر من الأندية الرائدة في كرة السلة الفلسطينية.


</p>
</div>
</li>
<hr/>


 <div id="c7">
    <p className="city">  
     <b> طوباس:</b>
     
     </p>

    
     <b> كرة القدم:</b>
       <br/>
       نادي شباب طوباس: يمثل المدينة في دوري المحترفين الفلسطيني.
   </div>
       <br/>    

 

<hr/>

<li>
    <div id="c8">
        <p className="city">  
         <b>  بيت لحم:</b>
         
        </p>
    
        <p>
         <b> كرة القدم:</b>
           <br/>
           ترجي واد النيص: أحد أندية بيت لحم العريقة وله تاريخ طويل في الدوري الفلسطيني.
       
           <br/><br/>
          <b> كرة الطائرة:</b>  
           <br/>
           نادي بيت لحم الرياضي: يركز على تطوير رياضة كرة الطائرة.
         <br/><br/>        
     
       </p>
     </div>
    </li>
    <hr/>


    
<li>
    <div id="c9">
        <p className="city">  
         <b>  جنين:</b>
         
        </p>
    
        <p>
         <b> كرة القدم:</b>
           <br/>
           نادي جنين الرياضي: يمثل مدينة جنين في بطولات كرة القدم المحلية.
       
           <br/><br/>

          <b>تنس الطاولة:</b>  
           <br/>
           أكاديمية جنين لتنس الطاولة: تهدف لتطوير اللاعبين الشباب.

           <br/><br/>        
     
       </p>
 </div>
</li>
</ul>


</div>
</div>





    
    
       
    );
 }; 
 export default Content ;